In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv("expenses.csv")
df2 = df
df2

       Date       Category  Amount
0  01-07-25           Food     200
1  01-07-25      Transport      50
2  02-07-25  Entertainment     120
3  03-07-25           Food     180
4  04-07-25      Utilities      90

In [6]:
# Calculate Total and Category-wise Expenses 

# Total Expenses

Total = df['Amount'].sum()
print(f"Total sum of All Expenses: {Total}")

# Expenses by Category

Category_Total = df.groupby('Category')['Amount'].sum()
print(f"\nCategory-wise sum:\n {Category_Total}")

Total sum of All Expenses: 640

Category-wise sum:
 Category
Entertainment    120
Food             380
Transport         50
Utilities         90
Name: Amount, dtype: int64

In [12]:
 # Identify Dates with Highest Expenses

daily_totals = df.groupby('Date')['Amount'].sum()
peak_date = daily_totals.idxmax()
peak_amount = daily_totals.max()
print(f"Highest Spend Date: {peak_date} and Amount: {peak_amount}")

Highest Spend Date: 01-07-25 and Amount: 250

In [13]:
# Handle Missing Values

df = df.fillna({'Amount':0, 'Category':'Unknown'})

In [14]:
df

       Date       Category  Amount
0  01-07-25           Food     200
1  01-07-25      Transport      50
2  02-07-25  Entertainment     120
3  03-07-25           Food     180
4  04-07-25      Utilities      90

In [19]:
# Export Monthly Summary

df['Date'] = pd.to_datetime(df['Date'])
df['Month'] = df['Date'].dt.to_period('M')
monthly_totals = df.groupby('Month')['Amount'].sum()
monthly_totals.to_csv('monthly_expense_summary.csv')